arvind747/S32K144_FlexCAN_LoopBackTest/SOURCE/PLATFORM/hal/src/lpspi/fsl_lpspi_hal.c
/*
 * Copyright (c) 2013 - 2015, Freescale Semiconductor, Inc.
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 *
 * o Redistributions of source code must retain the above copyright notice, this list
 *   of conditions and the following disclaimer.
 *
 * o Redistributions in binary form must reproduce the above copyright notice, this
 *   list of conditions and the following disclaimer in the documentation and/or
 *   other materials provided with the distribution.
 *
 * o Neither the name of Freescale Semiconductor, Inc. nor the names of its
 *   contributors may be used to endorse or promote products derived from this
 *   software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND
 * ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
 * WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR
 * ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
 * (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
 * LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON
 * ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
 * (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS
 * SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */

#include "fsl_lpspi_hal.h"


/*******************************************************************************
 * Definitions
 ******************************************************************************/

/*******************************************************************************
 * Variables
 ******************************************************************************/

/*******************************************************************************
 * Code
 ******************************************************************************/

/*FUNCTION**********************************************************************
 *
 * Function Name : LPSPI_HAL_IsModuleEnabled
 * Description   : Returns if the module is enabled or not..
 *
 *END**************************************************************************/
static bool LPSPI_HAL_IsModuleEnabled(LPSPI_Type * base)
{
    return (bool)BITBAND_ACCESS32(&(base->CR), LPSPI_CR_MEN_SHIFT);
}
/*FUNCTION**********************************************************************
 *
 * Function Name : LPSPI_HAL_Init
 * Description   : Resets the LPSPI internal logic and registers to their default settings.
 *
 * This function first performs a software reset of the LPSPI module which resets the
 * internal LPSPI logic and most registers, then proceeds to manually reset all of the
 * LPSPI registers to their default setting to ensuring these registers at programmed to
 * their default value which includes disabling the module.
 *
 *END**************************************************************************/
void LPSPI_HAL_Init(LPSPI_Type * base)
{
    /* Software reset the internal logic */
    BITBAND_ACCESS32(&(base->CR), LPSPI_CR_RST_SHIFT) = (uint32_t)1U;

    /* Now bring the LPSPI module out of reset and clear CR register */
    base->CR = (uint32_t)0x0;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : LPSPI_HAL_Config
 * Description   : Configures the LPSPI registers to a user defined configuration.
 *
 * Note, the LPSPI module must first be disabled prior to calling this function. It is recommended
 * to first call the LPSPI_HAL_Init function prior to calling this function.
 * This function configures the LPSPI based on the configuration passed in by the user
 * for normal SPI mode operation. Recommend single bit transfer: txCmd.width = LPSPI_SINGLE_BIT_XFER,
 * otherwise you will have to call function LPSPI_HAL_SetPinConfigMode to change the pin config.
 * This function sets the TX and RX FIFO watermarks to 0 such that the write blocking and read
 * blocking functions can be used following the init.
 *
 *END**************************************************************************/
lpspi_status_t LPSPI_HAL_Config(LPSPI_Type * base, const lpspi_init_config_t * config,
                               lpspi_tx_cmd_config_t * txCmdCfgSet, uint32_t * actualBaudRate)
{
    uint32_t tcrPre;

    /* Set for master or slave mode */
    if (LPSPI_HAL_SetMasterSlaveMode(base, config->lpspiMode) != LPSPI_STATUS_SUCCESS)
    {
        return LPSPI_STATUS_ERROR;
    }

    if (config->lpspiMode == LPSPI_MASTER)
    {
        /* First, set the baudrate and get the prescalar value */
        *actualBaudRate = LPSPI_HAL_SetBaudRate(base, config->baudRate, config->lpspiSrcClk,
                                                &tcrPre);
          if (actualBaudRate == 0)
        {
            return LPSPI_STATUS_ERROR;
        }

        /* Populate the TCR Prescaler */
        txCmdCfgSet->preDiv = tcrPre;

    }
    /* Configure the desired PCS polarity */
    LPSPI_HAL_SetPcsPolarityMode(base, txCmdCfgSet->whichPcs, config->pcsPol);

    /* Set Pin configuration for SDO-out and SDI-in */
    LPSPI_HAL_SetPinConfigMode(base, LPSPI_SDI_IN_SDO_OUT, LPSPI_DATA_OUT_RETAINED, true);

    /* Enable LPSPI */
    BITBAND_ACCESS32(&(base->CR), LPSPI_CR_MEN_SHIFT) = (uint32_t)1U;

    /* Program the transmit command register with all of the relevant parameters */
    LPSPI_HAL_SetTxCommandReg(base, txCmdCfgSet);

    /* Set FIFO watermarks to 0 */
    LPSPI_HAL_SetFifoWatermarks(base, 0U, 0U);

    return LPSPI_STATUS_SUCCESS;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : LPSPI_HAL_GetVersionId
 * Description   : Gets the Major, Minor and Feature ID of the LPSPI module.
 *
 *END**************************************************************************/
void LPSPI_HAL_GetVersionId(LPSPI_Type * base, uint32_t * major, uint32_t * minor,
                            uint32_t * feature)
{
    *major = (base->VERID & LPSPI_VERID_MAJOR_MASK) >> LPSPI_VERID_MAJOR_SHIFT;
    *minor = (base->VERID & LPSPI_VERID_MINOR_MASK) >> LPSPI_VERID_MINOR_SHIFT;
    *feature = (base->VERID & LPSPI_VERID_FEATURE_MASK) >> LPSPI_VERID_FEATURE_SHIFT;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : LPSPI_HAL_Disable
 * Description   : Disables the LPSPI module.
 *
 * Note that this function returns LPSPI_STATUS_BUSY if it is detected that the Module Busy Flag
 * (MBF) is set, otherwise, if success, it returns LPSPI_STATUS_SUCCESS.
 *
 *END**************************************************************************/
lpspi_status_t LPSPI_HAL_Disable(LPSPI_Type * base)
{
    uint32_t lpspi_tmp = base->SR;
    lpspi_tmp = (lpspi_tmp & LPSPI_SR_MBF_MASK) >> LPSPI_SR_MBF_SHIFT;

    if (lpspi_tmp == (uint32_t)1)
    {
        return LPSPI_STATUS_BUSY;
    }
    else
    {
        BITBAND_ACCESS32(&(base->CR), LPSPI_CR_MEN_SHIFT) = (uint32_t)0U;
        return LPSPI_STATUS_SUCCESS;
    }
}

/*FUNCTION**********************************************************************
 *
 * Function Name : LPSPI_HAL_GetVersionId
 * Description   : Configures the LPSPI for master or slave.
 *
 * Note that the LPSPI module must first be disabled before configuring this.
 *
 *END**************************************************************************/
lpspi_status_t LPSPI_HAL_SetMasterSlaveMode(LPSPI_Type * base, lpspi_master_slave_mode_t mode)
{

    /* If the module is enabled, return error */
    if (true == LPSPI_HAL_IsModuleEnabled(base))
    {
        return LPSPI_STATUS_ERROR;
    }
    else
    {
        BITBAND_ACCESS32(&(base->CFGR1), LPSPI_CFGR1_MASTER_SHIFT) = (uint32_t)mode;
        return LPSPI_STATUS_SUCCESS;
    }
}

/*FUNCTION**********************************************************************
 *
 * Function Name : LPSPI_HAL_GetFifoSizes
 * Description   : Gets the TX and RX FIFO sizes of the LPSPI module.
 *
 *END**************************************************************************/
void LPSPI_HAL_GetFifoSizes(LPSPI_Type * base, uint32_t * txFifoSize,
                            uint32_t * rxFifoSize)
{
    if (txFifoSize != NULL)
    {
    	*txFifoSize = 1U << ((base->PARAM & LPSPI_PARAM_TXFIFO_MASK) >> LPSPI_PARAM_TXFIFO_SHIFT);
    }
    if (rxFifoSize != NULL)
    {
        *rxFifoSize = 1U << ((base->PARAM & LPSPI_PARAM_RXFIFO_MASK) >> LPSPI_PARAM_RXFIFO_SHIFT);
    }
}

/*FUNCTION**********************************************************************
 *
 * Function Name : LPSPI_HAL_SetPinConfigMode
 * Description   : Flushes the LPSPI FIFOs.
 *
 *END**************************************************************************/
void LPSPI_HAL_SetFlushFifoCmd(LPSPI_Type * base, bool flushTxFifo, bool flushRxFifo)
{
    uint32_t crValue = 0;

