arvind747/S32K144_FlexCAN_LoopBackTest/SOURCE/PLATFORM/hal/src/lpspi/fsl_lpspi_hal.c
    crValue = ((uint32_t)flushTxFifo << LPSPI_CR_RTF_SHIFT) |
              ((uint32_t)flushRxFifo << LPSPI_CR_RRF_SHIFT);

    base->CR |= crValue;

}

/*FUNCTION**********************************************************************
 *
 * Function Name : LPSPI_HAL_ClearStatusFlag
 * Description   : Clears the LPSPI status flag.
 *
 * This function clears the state of one of the LPSPI status flags as requested by
 * the user. Note, the flag must be w1c capable, if not the function returns an error.
 * w1c capable flags are:
 *   LPSPI_WORD_COMPLETE
 *   LPSPI_FRAME_COMPLETE
 *   LPSPI_TRANSFER_COMPLETE
 *   LPSPI_TRANSMIT_ERROR
 *   LPSPI_RECEIVE_ERROR
 *   LPSPI_DATA_MATCH
 *
 *END**************************************************************************/
lpspi_status_t LPSPI_HAL_ClearStatusFlag(LPSPI_Type * base, lpspi_status_flag_t statusFlag)
{
    /* If the flag is not w1c capable, return invalid parameter error */
    if ((statusFlag == LPSPI_MODULE_BUSY) ||
        (statusFlag == LPSPI_RX_DATA_FLAG) ||
        (statusFlag == LPSPI_TX_DATA_FLAG))
    {
        return LPSPI_STATUS_INVALID_PARAMETER;
    }
    else
    {
        if (statusFlag == LPSPI_ALL_STATUS)
        {
            base->SR = LPSPI_ALL_STATUS;
        }
        else
        {
            base->SR = (1U << statusFlag);
        }
        return LPSPI_STATUS_SUCCESS;
    }
}

/*FUNCTION**********************************************************************
 *
 * Function Name : LPSPI_HAL_SetHostRequestMode
 * Description   : Configures the LPSPI Host Request input.
 *
 * This function allows the user to configure the host request input pin as follows:
 *  Enable or disable the host request functionality.
 *  Select the polarity of the host request signal.
 *  Select the source of the host request (external signal or internal trigger).
 *
 *END**************************************************************************/
void LPSPI_HAL_SetHostRequestMode(LPSPI_Type * base,
                                  lpspi_host_request_select_t hostReqInput,
                                  lpspi_signal_polarity_t hostReqPol,
                                  bool enable)
{
    uint32_t cfgr0Value = 0;

    cfgr0Value = base->CFGR0 &
                 ~(LPSPI_CFGR0_HREN_MASK|LPSPI_CFGR0_HRPOL_MASK|LPSPI_CFGR0_HRSEL_MASK);

    cfgr0Value |= (uint32_t)(enable) |
                  (uint32_t)(hostReqPol << LPSPI_CFGR0_HRPOL_SHIFT) |
                  (uint32_t)(hostReqInput << LPSPI_CFGR0_HRSEL_SHIFT);

    base->CFGR0 = cfgr0Value;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : LPSPI_HAL_SetPcsPolarityMode
 * Description   : Configures the desired LPSPI PCS polarity.
 *
 * This function allows the user to configure the polarity of a particular PCS signal.
 * Note that the LPSPI module must first be disabled before configuring this.
 *
 *END**************************************************************************/
lpspi_status_t LPSPI_HAL_SetPcsPolarityMode(LPSPI_Type * base, lpspi_which_pcs_t whichPcs,
                                            lpspi_signal_polarity_t pcsPolarity)
{
    uint32_t cfgr1Value = 0;

    /* If the module is enabled, return error */
    if (true == LPSPI_HAL_IsModuleEnabled(base))
    {
        return LPSPI_STATUS_ERROR;
    }
    else
    {
        /* Clear the PCS polarity bit */
        cfgr1Value = base->CFGR1 & ~(1U << (LPSPI_CFGR1_PCSPOL_SHIFT + whichPcs));

        /* Configure the PCS polarity bit according to the pcsPolarity setting */
        cfgr1Value |= (uint32_t)pcsPolarity << (LPSPI_CFGR1_PCSPOL_SHIFT + whichPcs);

        base->CFGR1 = cfgr1Value;

        return LPSPI_STATUS_SUCCESS;
    }
}

/*FUNCTION**********************************************************************
 *
 * Function Name : LPSPI_HAL_SetMatchConfigMode
 * Description   : Configures the LPSPI data match configuration mode.
 *
 * When enabled and configured to the desired condition of type lpspi_match_config_t,
 * the LPSPI will assert the DMF status flag if the data match condition is met.
 * Note that the LPSPI module must first be disabled before configuring this.
 *
 *END**************************************************************************/
lpspi_status_t LPSPI_HAL_SetMatchConfigMode(LPSPI_Type * base,
                                            lpspi_match_config_t matchCondition,
                                            bool rxDataMatchOnly,
                                            uint32_t match0,
                                            uint32_t match1)
{
    uint32_t cfgr1Value = 0;

    /* If the module is enabled, return error */
    if (true == LPSPI_HAL_IsModuleEnabled(base))
    {
        return LPSPI_STATUS_ERROR;
    }
    else
    {
        cfgr1Value = base->CFGR1 & ~(LPSPI_CFGR1_MATCFG_MASK);
        cfgr1Value |= ((uint32_t)matchCondition << LPSPI_CFGR1_MATCFG_SHIFT);
        base->CFGR1 = cfgr1Value;

        BITBAND_ACCESS32(&(base->CFGR0), LPSPI_CFGR0_RDMO_SHIFT) = (uint32_t)rxDataMatchOnly;

        base->DMR0 = match0;
        base->DMR1 = match1;

        return LPSPI_STATUS_SUCCESS;
    }
}

/*FUNCTION**********************************************************************
 *
 * Function Name : LPSPI_HAL_SetPinConfigMode
 * Description   : Configures the LPSPI SDO/SDI pin configuration mode.
 *
 * This function configures the pin mode of the LPSPI.
 * For the SDI and SDO pins, the user can configure these pins as follows:
 *  SDI is used for input data and SDO for output data.
 *  SDO is used for input data and SDO for output data.
 *  SDI is used for input data and SDI for output data.
 *  SDO is used for input data and SDI for output data.
 *
 * The user has the option to configure the output data as:
 *  Output data retains last value when chip select is de-asserted (default setting).
 *  Output data is tristated when chip select is de-asserted.
 *
 * Finally, the user has the option to configure the PCS[3:2] pins as:
 *  Enabled for PCS operation (default setting).
 *  Disabled - this is need if the user wishes to configure the LPSPI mode for 4-bit transfers
 *             where these pins will be used as I/O data pins.
 *
 * Note that the LPSPI module must first be disabled before configuring this.
 *
 *END**************************************************************************/
lpspi_status_t LPSPI_HAL_SetPinConfigMode(LPSPI_Type * base,
                                          lpspi_pin_config_t pinCfg,
                                          lpspi_data_out_config_t dataOutConfig,
                                          bool pcs3and2Enable)
{
    uint32_t cfgr1Value = 0;

    /* If the module is enabled, return error */
    if (true == LPSPI_HAL_IsModuleEnabled(base))
    {
        return LPSPI_STATUS_ERROR;
    }
    else
    {
        cfgr1Value = base->CFGR1 &
                     ~(LPSPI_CFGR1_PINCFG_MASK|LPSPI_CFGR1_OUTCFG_MASK|LPSPI_CFGR1_PCSCFG_MASK);

