arvind747/S32K144_FlexCAN_LoopBackTest/SOURCE/PLATFORM/hal/src/lpspi/fsl_lpspi_hal.c
        cfgr1Value |= (uint32_t)(pinCfg << LPSPI_CFGR1_PINCFG_SHIFT) |
                      (uint32_t)(dataOutConfig << LPSPI_CFGR1_OUTCFG_SHIFT) |
                      (uint32_t)((!pcs3and2Enable) << LPSPI_CFGR1_PCSCFG_SHIFT);  /* enable = 0 */

        base->CFGR1 = cfgr1Value;

        return LPSPI_STATUS_SUCCESS;
    }
}

/*FUNCTION**********************************************************************
 *
 * Function Name : LPSPI_HAL_SetBaudRate
 * Description   : Sets the LPSPI baud rate in bits per second.
 *
 * This function takes in the desired bitsPerSec (baud rate) and calculates the nearest
 * possible baud rate without exceeding the desired baud rate, and returns the
 * calculated baud rate in bits-per-second. It requires that the caller also provide
 * the frequency of the module source clock (in Hertz). Also note that the baud rate
 * does not take into affect until the Transmit Control Register (TCR) is programmed
 * with the PRESCALE value. Hence, this function returns the PRESCALE tcrPrescaleValue
 * parameter for later programming in the TCR.  It is up to the higher level
 * peripheral driver to alert the user of an out of range baud rate input.
 *
 * Note that the LPSPI module must first be disabled before configuring this.
 * Note that the LPSPI module must be configure for master mode before configuring this.
 *
 *END**************************************************************************/
uint32_t LPSPI_HAL_SetBaudRate(LPSPI_Type * base, uint32_t bitsPerSec,
                               uint32_t sourceClockInHz, uint32_t * tcrPrescaleValue)
{
	uint32_t lpspi_tmp;

	/* For master mode configuration only, if slave mode detected, return 0.
     * Also, the LPSPI module needs to be disabled first, if enabled, return 0
     */
    if ((LPSPI_HAL_IsMaster(base) != true) || (true == LPSPI_HAL_IsModuleEnabled(base)))
    {
        return 0;
    }

    uint32_t prescaler, bestPrescaler;
    uint32_t scaler, bestScaler;
    uint32_t realBaudrate, bestBaudrate;
    uint32_t diff, min_diff;
    uint32_t desiredBaudrate = bitsPerSec;

    /* find combination of prescaler and scaler resulting in baudrate closest to the
     * requested value
     */
    min_diff = 0xFFFFFFFFU;

    /* Set to maximum divisor value bit settings so that if baud rate passed in is less
     * than the minimum possible baud rate, then the SPI will be configured to the lowest
     * possible baud rate
     */
    bestPrescaler = 7;
    bestScaler = 255;

    bestBaudrate = 0; /* required to avoid compilation warning */

    /* In all for loops, if min_diff = 0, the exit for loop*/
    for (prescaler = 0; (prescaler < 8) && min_diff; prescaler++)
    {
        for (scaler = 0; (scaler < 256) && min_diff; scaler++)
        {
            realBaudrate = (sourceClockInHz /
                            (s_baudratePrescaler[prescaler] * (scaler + 2U)));

            /* calculate the baud rate difference based on the conditional statement
             * that states that the calculated baud rate must not exceed the desired baud rate
             */
            if (desiredBaudrate >= realBaudrate)
            {
                diff = desiredBaudrate - realBaudrate;
                if (min_diff > diff)
                {
                    /* a better match found */
                    min_diff = diff;
                    bestPrescaler = prescaler;
                    bestScaler = scaler;
                    bestBaudrate = realBaudrate;
                }
            }
        }
    }

    /* Write the best baud rate scalar to the CCR.
     * Note, no need to check for error since we've already checked to make sure the module is
     * disabled and in master mode. Also, there is a limit on the maximum divider so we will not
     * exceed this.
     */
    lpspi_tmp = base->CCR;
    lpspi_tmp &= ~(LPSPI_CCR_SCKDIV_MASK);
    lpspi_tmp |= LPSPI_CCR_SCKDIV(bestScaler);
    base->CCR = lpspi_tmp;


    /* return the best prescaler value for user to use later */
    *tcrPrescaleValue = bestPrescaler;

    /* return the actual calculated baud rate */
    return bestBaudrate;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : LPSPI_HAL_SetBaudRateDivisor
 * Description   : Configures the baud rate divisor manually (only the LPSPI_CCR[SCKDIV]).
 *
 * This function allows the caller to manually set the baud rate divisor in the event
 * that this divider is known and the caller does not wish to call the
 * LPSPI_HAL_SetBaudRate function. Note that this only affects the LPSPI_CCR[SCKDIV]).
 * The Transmit Control Register (TCR) is programmed separately with the PRESCALE value.
 * The valid range is 0x00 to 0xFF (255), if the user inputs outside of this range, an error
 * is returned.
 *
 * Note that the LPSPI module must first be disabled before configuring this.
 * Note that the LPSPI module must be configure for master mode before configuring this.
 *
 *END**************************************************************************/
lpspi_status_t LPSPI_HAL_SetBaudRateDivisor(LPSPI_Type * base, uint32_t divisor)
{
	uint32_t lpspi_tmp;


    /* LPSPI must first be disabled before setting the SCKDIV value and set to master mode */
    if ((true == LPSPI_HAL_IsModuleEnabled(base)) || (LPSPI_HAL_IsMaster(base) != true))
    {
        return LPSPI_STATUS_ERROR;
    }
    else if (divisor > 255)
    {
        return LPSPI_STATUS_OUT_OF_RANGE;
    }
    else
    {
        lpspi_tmp = base->CCR;
        lpspi_tmp &= ~(LPSPI_CCR_SCKDIV_MASK);
        lpspi_tmp |= LPSPI_CCR_SCKDIV(divisor);
        base->CCR = lpspi_tmp;

        return LPSPI_STATUS_SUCCESS;
    }
}

/*FUNCTION**********************************************************************
 *
 * Function Name : LPSPI_HAL_SetDelay
 * Description   : Manually configures a specific LPSPI delay parameter (module must be disabled to
 *                 change the delay values).
 *
 * This function configures the:
 * SCK to PCS delay, or
 * PCS to SCK delay, or
 * Between transfer delay.
 *
 * These delay names are available in type lpspi_delay_type_t.
 *
 * The user passes which delay they want to configure along with the delay value.
 * This allows the user to directly set the delay values if they have
 * pre-calculated them or if they simply wish to manually increment the value.
 *
 * Note that the LPSPI module must first be disabled before configuring this.
 * Note that the LPSPI module must be configure for master mode before configuring this.
 *
 *END**************************************************************************/
lpspi_status_t LPSPI_HAL_SetDelay(LPSPI_Type * base, lpspi_delay_type_t whichDelay, uint32_t delay)
{
    uint32_t ccrValue = 0;

    /* LPSPI must first be disabled before setting the delay value and set to master mode */
    if ((true == LPSPI_HAL_IsModuleEnabled(base)) || (LPSPI_HAL_IsMaster(base) != true))
    {
        return LPSPI_STATUS_ERROR;
    }
    else if (delay > 255)
    {
        return LPSPI_STATUS_OUT_OF_RANGE;
    }
    else
    {
        ccrValue = base->CCR & ~(0xFFU << whichDelay);
        ccrValue |= delay << whichDelay;
        base->CCR = ccrValue;
        return LPSPI_STATUS_SUCCESS;
    }
}

/*FUNCTION**********************************************************************
 *
 * Function Name : LPSPI_HAL_CalculateDelay
 * Description   : Calculates the delay based on the desired delay input in nanoseconds
 *                 (module must be disabled to change the delay values).
 *
 * This function calculates the values for:
 * SCK to PCS delay, or
 * PCS to SCK delay, or
 * Between transfer delay.
 *
 * These delay names are available in type lpspi_delay_type_t.
 *
 * The user passes which delay they want to configure along with the desired delay value in
 * nano-seconds.  The function calculates the value needed for the desired delay parameter
 * and returns the actual calculated delay as an exact delay match may not be possible. In this
 * case, the closest match is calculated without going below the desired delay value input.
 * It is possible to input a very large delay value that exceeds the capability of the part, in
 * which case the maximum supported delay will be returned. It is up to the higher level
 * peripheral driver to alert the user of an out of range delay input.
 *
 * Note that the LPSPI module must first be disabled before configuring this.
 * Note that the LPSPI module must be configure for master mode before configuring this.
 *
 *END**************************************************************************/
lpspi_status_t LPSPI_HAL_CalculateDelay(LPSPI_Type * base,
                                        lpspi_delay_type_t whichDelay,
                                        uint32_t sourceClockInHz,
                                        uint32_t delayInNanoSec,
                                        uint32_t * actualDelay)
{
    lpspi_status_t returnStatus = LPSPI_STATUS_SUCCESS;

    /* LPSPI must first be disabled before setting the delay value and set to master mode */
    if ((true == LPSPI_HAL_IsModuleEnabled(base)) || (LPSPI_HAL_IsMaster(base) != true))
    {
        return LPSPI_STATUS_ERROR;
    }

