arvind747/S32K144_FlexCAN_LoopBackTest/SOURCE/PLATFORM/hal/src/lpspi/fsl_lpspi_hal.c
    uint64_t realDelay, bestDelay;
    uint32_t scaler, bestScaler;
    uint32_t diff, min_diff;
    uint64_t initialDelayNanoSec;

    /* For delay between transfer, an additional scaler value is needed */
    uint32_t additionalScaler = 0;

    /* find combination of prescaler and scaler resulting in the delay closest to the
     * requested value
     */
    min_diff = 0xFFFFFFFFU;

    /* Initialize scaler to max value to generate the max delay */
    bestScaler = 0xFFU;

    /* Calculate the initial (min) delay and maximum possible delay based on the specific delay as
     * the delay divisors are slightly different based on which delay we are configuring.
     */
    if (whichDelay == LPSPI_BETWEEN_TRANSFER)
    {
        /* First calculate the initial, default delay, note min delay is 2 clock cycles
           Due to large size of calculated values (uint64_t), we need to break up the
           calculation into several steps to ensure accurate calculated results
         */
        initialDelayNanoSec = 1000000000U;
        initialDelayNanoSec *= 2U;
        initialDelayNanoSec /= sourceClockInHz;

        /* Calculate the maximum delay */
        bestDelay = 1000000000U;
        bestDelay *= 257U; /* based on DBT+2, or 255 + 2 */
        bestDelay /= sourceClockInHz;

        additionalScaler = 1U;
    }
    else
    {
        /* First calculate the initial, default delay, min delay is 1 clock cycle
           Due to large size of calculated values (uint64_t), we need to break up the
           calculation into several steps to ensure accurate calculated results
         */
        initialDelayNanoSec = 1000000000U;
        initialDelayNanoSec /= sourceClockInHz;


        /* Calculate the maximum delay */
        bestDelay = 1000000000U;
        bestDelay *= 256U; /* based on SCKPCS+1 or PCSSCK+1, or 255 + 1 */
        bestDelay /= sourceClockInHz;

        additionalScaler = 0;
    }

    /* If the initial, default delay is already greater than the desired delay, then
     * set the delay to their initial value (0) and return the delay. In other words,
     * there is no way to decrease the delay value further.
     */
    if (initialDelayNanoSec >= delayInNanoSec)
    {
        LPSPI_HAL_SetDelay(base, whichDelay, 0);
        *actualDelay = initialDelayNanoSec;
        return returnStatus;
    }

    /* If min_diff = 0, the exit for loop */
    for (scaler = 0; (scaler < 256U) && min_diff; scaler++)
    {
        /* Calculate the real delay value as we cycle through the scaler values.
           Due to large size of calculated values (uint64_t), we need to break up the
           calculation into several steps to ensure accurate calculated results
         */
        realDelay = 1000000000U;
        realDelay *= (scaler + 1 + additionalScaler);
        realDelay /= sourceClockInHz;

        /* calculate the delay difference based on the conditional statement
         * that states that the calculated delay must not be less then the desired delay
         */
        if (realDelay >= delayInNanoSec)
        {
            diff = realDelay-delayInNanoSec;
            if (min_diff > diff)
            {
                /* a better match found */
                min_diff = diff;
                bestScaler = scaler;
                bestDelay = realDelay;
            }
        }
    }

    /* write the best scaler value for the delay */
    returnStatus = LPSPI_HAL_SetDelay(base, whichDelay, bestScaler);

    /* return the actual calculated delay value (in ns) */
    *actualDelay = (uint32_t)bestDelay;

    return returnStatus;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : LPSPI_HAL_SetTxCommandReg
 * Description   : Sets the Transmit Command Register (TCR) parameters.
 *
 * The Transmit Command Register (TCR) contains multiple parameters that affect
 * the transmission of data, such as clock phase and polarity, which PCS to use,
 * whether or not the PCS remains asserted at the completion of a frame, etc.
 * Any writes to this register results in an immediate push of the entire register
 * and its contents to the TX FIFO.  Hence, writes to this register should include
 * all of the desired parameters written to the register at once. Hence, the user
 * should fill in the members of the lpspi_tx_cmd_config_t data structure and pass
 * this to the function.
 *
 *END**************************************************************************/
void LPSPI_HAL_SetTxCommandReg(LPSPI_Type * base, lpspi_tx_cmd_config_t * txCmdCfgSet)
{
     base->TCR = ((uint32_t)txCmdCfgSet->clkPolarity << LPSPI_TCR_CPOL_SHIFT |
                         (uint32_t)txCmdCfgSet->clkPhase << LPSPI_TCR_CPHA_SHIFT |
                         (uint32_t)txCmdCfgSet->preDiv << LPSPI_TCR_PRESCALE_SHIFT |
                         (uint32_t)txCmdCfgSet->whichPcs << LPSPI_TCR_PCS_SHIFT |
                         (uint32_t)txCmdCfgSet->lsbFirst << LPSPI_TCR_LSBF_SHIFT |
                         (uint32_t)txCmdCfgSet->byteSwap<< LPSPI_TCR_BYSW_SHIFT |
                         (uint32_t)txCmdCfgSet->contTransfer << LPSPI_TCR_CONT_SHIFT |
                         (uint32_t)txCmdCfgSet->contCmd << LPSPI_TCR_CONTC_SHIFT |
                         (uint32_t)txCmdCfgSet->rxMask << LPSPI_TCR_RXMSK_SHIFT |
                         (uint32_t)txCmdCfgSet->txMask << LPSPI_TCR_TXMSK_SHIFT |
                         (uint32_t)txCmdCfgSet->width << LPSPI_TCR_WIDTH_SHIFT |
                         (uint32_t)(txCmdCfgSet->frameSize - 1) << LPSPI_TCR_FRAMESZ_SHIFT);
}

/*FUNCTION**********************************************************************
 *
 * Function Name : LPSPI_HAL_WriteDataBlocking
 * Description   : Writes a data into the TX data buffer and waits till complete to return.
 *
 * This function writes the data to the Transmit Data Register (TDR) and waits for completion
 * before returning. If the frame size exceeds 32-bits, the user will have to manage sending
 * the data one 32-bit word at a time.
 * This function can be used for either master or slave mode.
 * Note that it is required that the TX FIFO watermark be set to 0.
 *
 *END**************************************************************************/
void LPSPI_HAL_WriteDataBlocking(LPSPI_Type * base, uint32_t data)
{
    /* Wait until the transmit data is requested */
    while(!LPSPI_HAL_GetStatusFlag(base, LPSPI_TX_DATA_FLAG)) { }

    base->TDR = data;

    /* Wait until the transmit data is requested */
    while(!LPSPI_HAL_GetStatusFlag(base, LPSPI_TX_DATA_FLAG)) { }
}


/*FUNCTION**********************************************************************
 *
 * Function Name : LPSPI_HAL_ReadDataBlocking
 * Description   : Reads data from the data buffer but first waits till data is ready.
 *
 * This function reads the data from the Receive Data Register (RDR).
 * However, before reading the data, it first waits till the read data ready status
 * indicates the data is ready to be read.
 * This function can be used for either master or slave mode.
 * Note that it is required that the RX FIFO watermark be set to 0.
 *
 *END**************************************************************************/
uint32_t LPSPI_HAL_ReadDataBlocking(LPSPI_Type * base)
{
    /* Wait for Receive Data Flag to indicate receive data is ready */
    while(!LPSPI_HAL_GetStatusFlag(base, LPSPI_RX_DATA_FLAG)) { }

    /* Now read the received data  */
    return base->RDR;
}

/*******************************************************************************
 * EOF
 ******************************************************************************/
